# Представьте, что вы шпионы)
# Придумайте шифр, в котором буквы заменяются на какие-то символы
# и реализуйте шифроватор и дешифроватор
code = {'а':'!!!', 'б':'!!@', 'в':'!@!', 'г':'!@@',
        'д':'@!@', 'е':'@@!', 'ё':'@@@', 'ж':'###',
        'з':'##$', 'и':'#$#', 'й':'#$$', 'к':'$#$',
        'л':'$$#', 'м':'$$$', 'н':'!!#', 'о':'!#!',
        'п':'!##', 'р':'#!#', 'с':'##!', 'т':'!!$',
        'у':'!$!', 'ф':'!$$', 'х':'$!$', 'ц':'$$!',
        'ч':'@@#', 'ш':'@#@', 'щ':'@##', 'ъ':'#@#',
        'ы':'##@', 'ь':'$$@', 'э':'$@$', 'ю':'$@@',
        'я':'@$@', ' ':'_'}
decode = {'!!!':'а', '!!@':'б', '!@!':'в', '!@@':'г',
        '@!@':'д', '@@!':'е', '@@@':'ё', '###':'ж',
        '##$':'з', '#$#':'и', '#$$':'й', '$#$':'к',
        '$$#':'л', '$$$':'м', '!!#':'н', '!#!':'о',
        '!##':'п', '#!#':'р', '##!':'с', '!!$':'т',
        '!$!':'у', '!$$':'ф', '$!$':'х', '$$!':'ц',
        '@@#':'ч', '@#@':'ш', '@##':'щ', '#@#':'ъ',
        '##@':'ы', '$$@':'ь', '$@$':'э', '$@@':'ю',
        '@$@':'я', '_':' '}
print('1 - шифроватор, 2 - дешифроватор ')
k = int(input())
if k == 1:
    word = input()
    mas = list(word)
    rez = []
    for i in range(len(mas)):
        rez.append(code[mas[i]])
    print(''.join(rez))
if k == 2:
    word = input()
    mas = [word[i:i + 3] for i in range(0, len(word), 3)]
    rez = []
    for j in range(len(mas)):
        rez.append(decode[mas[j]])
    print(''.join(rez))
